# ==============================================================================#
# =============================КОНВЕРТОР ФИГУР==================================#
# ==============================================================================#
from turtle import *
from time import *

reset()

ht()

speed(12)
delay(0)
color("#ff0000", "#0000ff")
lt(90)


def conv(x, y, t):
    for i in range(y):
        fd(x)
        lt(t)


x = int(input("Выберите длинну стороны рисунка. (в пикселях) "))
y = int(input("Выберите сколько раз будет повторяться одна линия. "))
t = int(input("Выберите разворот перед второй линией. (в градусах) "))
a = int(input("Выберите через сколько удалится ваша фигура? (в секундах) "))
z = int(input("Выберите ширину вашей фигуры. "))
print("Готово! Чтобы просмотреть вашу фигуру зайдите во вкладку Python Turtle Graphics.")

width(z)
begin_fill()
conv(x, y, t)
end_fill()
sleep(a)
clear()
pu()

exitonclick()
# ==============================================================================#
# ========================ВЕРСИЯ КОНВЕРТОРА ФИГУР: BETA 4.0======================#
# ==============================================================================#
